# В приложении заданы словари с названиями, рейтингами и жанрами сериалов shows и ratings.
# Напишите программу, которая состоит из двух функций:
# - Первая функция получает на вход словарь shows и название жанра.
# Функция должна вернуть все названия сериалов для заданного жанра;
# - Вторая функция получает на вход словарь ratings и список названий сериалов.
# Функция должна вернуть средний рейтинг для сериалов из входного списка.
# Создайте модуль, содержащий эти функции. Импортируйте модуль в свою программу и с помощью этих двух функций
# исследуйте средний рейтинг для жанров "драма" и "криминал".

from functions import *
